api/booking/create.json

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>...</soap:Header>
  <soap:Body>
    <CreateBookingRequest xmlns="http://webservices.micros.com/ows/5.1/Reservation.wsdl">
      
      <HotelReference chainCode="WC" hotelCode="SEFIVE"/>

      <RoomStay>
        <TimeSpan start="2026-07-01" end="2026-07-03"/>
        <GuestCounts>
          <GuestCount ageQualifyingCode="ADULT" count="2"/>
        </GuestCounts>
      </RoomStay>

      <ResGuests>
        <ResGuest>
          <Profiles>
            <ProfileInfo>
              <Profile>
                <Customer>
                  <PersonName>
                    <GivenName>John</GivenName>
                    <Surname>Doe</Surname>
                  </PersonName>
                  <Telephone>123456789</Telephone>
                  <Email>john@example.com</Email>
                </Customer>
              </Profile>
            </ProfileInfo>
          </Profiles>
        </ResGuest>
      </ResGuests>

    </CreateBookingRequest>
  </soap:Body>
</soap:Envelope>
